//=============================================================================
//
// デバッグ表示プログラム [Debug.h]
// Author : TAKUYA EBIHARA
//
//=============================================================================
#ifndef DEBUG_H
#define DEBUG_H

//=============================================================================
// 定数定義
//=============================================================================
#define TEXT_MAX    (1024)

//=============================================================================
// クラス宣言
//=============================================================================
class CDebug
{
public:
    static char m_Text[TEXT_MAX];
    static void ClearText(void);
    static void AddText(char *text);
	static void Init(void);
	static void Uninit(void);
    static void Draw(void);

private:
    static LPD3DXFONT m_pFont;         // フォントへのポインタ
};

#endif