
//================================================================================================
//
// リザルト管理 [ResultMode.cpp]
// Author : TAKUYA EBIHARA
//
//================================================================================================
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "ResultMode.h"
#include "TitleMode.h"
#include "Fade.h"
#include "scene.h"
#include "scene2D.h"
#include "ResultBG.h"
#include "ResultLogo.h"
#include "input.h"
#include "sound.h"

//=================================================================================================
// 静的メンバ変数
//=================================================================================================

//*************************************************************************************************
// 初期化処理
//*************************************************************************************************
HRESULT CResultMode::Init(void)
{
	CManager::mode = MODE_RESULT;

	CResultBG::Create();
    CResultLogo::Create();

    CManager::GetSound()->PlaySound(SOUND_LABEL_RESULT);

	return 0;
}

//*************************************************************************************************
// 終了処理
//*************************************************************************************************
void CResultMode::Uninit(void)
{
	//オブジェクトの解放
	CScene::ReleaseAll();

    CManager::GetSound()->StopSound(SOUND_LABEL_RESULT);

}

//*************************************************************************************************
// 更新処理
//*************************************************************************************************
void CResultMode::Update(void)
{
	if (CManager::GetInputKeyboard()->GetKeyTrigger(DIK_RETURN)) {
		CFade::SetFade(FADE_OUT, new CTitleMode);
	}
}

//*************************************************************************************************
// 描画処理
//*************************************************************************************************
void CResultMode::Draw(void)
{
}
